GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
			mytime_to_bcd( tmpbuf, jt808_param.id_0xF030 ); /*首次安装时间*/
			vdr_pack_buf( buf + 15, tmpbuf, 6, &fcs );
			i			= jt808_param.id_0xF032 * 10;       /*初次安装里程 0.1KM BCD码 00-99999999*/
			tmpbuf[0]	= ( ( ( i / 10000000 ) % 10 ) << 4 ) | ( ( i / 1000000 ) % 10 );
			tmpbuf[1]	= ( ( ( i / 100000 ) % 10 ) << 4 ) | ( ( i / 10000 ) % 10 );
			tmpbuf[2]	= ( ( ( i / 1000 ) % 10 ) << 4 ) | ( ( i / 100 ) % 10 );
			tmpbuf[3]	= ( ( ( i / 10 ) % 10 ) << 4 ) | ( i % 10 );
			vdr_pack_buf( buf + 21, tmpbuf, 4, &fcs );
			i			= jt808_param.id_0xF020 * 10;       /*总里程 0.1KM BCD码 00-99999999*/
			tmpbuf[0]	= ( ( ( i / 10000000 ) % 10 ) << 4 ) | ( ( i / 1000000 ) % 10 );
			tmpbuf[1]	= ( ( ( i / 100000 ) % 10 ) << 4 ) | ( ( i / 10000 ) % 10 );
			tmpbuf[2]	= ( ( ( i / 1000 ) % 10 ) << 4 ) | ( ( i / 100 ) % 10 );
			tmpbuf[3]	= ( ( ( i / 10 ) % 10 ) << 4 ) | ( i % 10 );
			vdr_pack_buf( buf + 25, tmpbuf, 4, &fcs );
			buf[29] = fcs;
			jt808_tx_ack( 0x0700, buf, 30 );
			break;
		case 0x04: /*特征系数*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x04\x00\x08\x00", 6, &fcs );
			vdr_pack_buf( buf + 9, gps_baseinfo.datetime, 6, &fcs );
			vdr_pack_word( buf + 15, jt808_param.id_0xF033, &fcs );
			buf[17] = fcs;
			jt808_tx_ack( 0x0700, buf, 18 );
			break;
		case 0x05: /*车辆信息  41byte*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x05\x00\x29\x00", 6, &fcs );
			vdr_pack_buf( buf + 9, jt808_param.id_0x0083, 12, &fcs );
			vdr_pack_buf( buf + 21, "大型汽车    ", 12, &fcs );
			buf[33] = fcs;
			jt808_tx_ack( 0x0700, buf, 34 );
			break;
		case 0x06:                              /*状态信号配置信息 87byte*/
			buf[0]	= seq >> 8;
			buf[1]	= seq & 0xff;
			buf[2]	= cmd;
			fcs		= 0;
			vdr_pack_buf( buf + 3, "\x55\x7A\x06\x00\x57\x00", 6, &fcs );
			vdr_pack_buf( buf + 9, gps_baseinfo.datetime, 6, &fcs );
			vdr_pack_byte( buf + 15, 1, &fcs ); /*状态信号字节个数*/
			vdr_pack_buf( buf + 16, "用户自定义", 10, &fcs );
			vdr_pack_buf( buf + 26, "用户自定义", 10, &fcs );
			vdr_pack_buf( buf + 36, "用户自定义", 10, &fcs );
			vdr_pack_buf( buf + 46, "近光\0\0\0\0\0\0", 10, &fcs );
			vdr_pack_buf( buf + 56, "远光\0\0\0\0\0\0", 10, &fcs );
			vdr_pack_buf( buf + 66, "右转向\0\0\0\0", 10, &fcs );
			vdr_pack_buf( buf + 76, "左转向\0\0\0\0", 10, &fcs );
			vdr_pack_buf( buf + 86, "制动\0\0\0\0\0\0", 10, &fcs );
			buf[97] = fcs;
			jt808_tx_ack( 0x0700, buf, 98 );
			break;
		case 8:                                 /*08记录*/
		case 9:
		case 0x10:
		case 0x11:
		case 0x12:
			if( len == 1 )                      /*获取所有记录*/
			{
				start	= 0;
				end		= 0xffffffff;
				blocks	= 0;
			}else if( len == 22 )               /*下来的格式 <55><7A><cmd><len(2byte)><保留><data_block(14byte)><XOR>*/
			{
				psrc	= pmsg + 12 + 1 + 7;    /*12字节头+1byte命令字+7字节vdr数据*/
				start	= mytime_from_bcd( psrc );
				end		= mytime_from_bcd( psrc + 6 );
				blocks	= ( *( psrc + 32 ) << 8 ) | ( *( psrc + 33 ) );
			}else
			{
				rt_kprintf( "\n%d>8700的格式不识别", rt_tick_get( ) );
				return;
			}
			vdr_08_12_get_ready( cmd, seq, start, end, blocks );
			break;
		case 0x13:
			break;
		case 0x14:
			break;
		case 0x15:
			break;
		case 0x82:          /*设置车辆信息*/
			if( len == 1 )  /*消息体为空*/
			{
				break;
			}
		case 0x83:          /*设置初次安装日期*/
			break;
		case 0x84:          /*设置状态量配置*/
			break;

		case 0xC2:          /*设置记录仪时间*/
			if( len == 7 )  /*命令字+时间BCD*/
			{
			}
			break;
		case 0xC3:          /*设置脉冲系数*/
			break;
		case 0xC4:          /*设置初始里程*/
			break;
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void vdr_rx_8701( uint8_t * pmsg )
{
}

/************************************** The End Of File **************************************/
